Model: "TTNet-Tensorflow"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
input_1 (InputLayer)            [(None, 320, 128, 81 0
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 320, 128, 64) 5248        input_1[0][0]
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 320, 128, 64) 256         conv2d[0][0]
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 320, 128, 64) 0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 320, 128, 64) 36928       re_lu[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 320, 128, 64) 256         conv2d_1[0][0]
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 320, 128, 64) 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 160, 64, 64)  0           re_lu_1[0][0]
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 160, 64, 64)  36928       max_pooling2d[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 160, 64, 64)  256         conv2d_2[0][0]
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 160, 64, 64)  0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 80, 32, 64)   0           re_lu_2[0][0]
__________________________________________________________________________________________________
dropout (Dropout)               (None, 80, 32, 64)   0           max_pooling2d_1[0][0]
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 80, 32, 128)  73856       dropout[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 80, 32, 128)  512         conv2d_3[0][0]
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 80, 32, 128)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 40, 16, 128)  0           re_lu_3[0][0]
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 40, 16, 128)  147584      max_pooling2d_2[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 40, 16, 128)  512         conv2d_4[0][0]
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 40, 16, 128)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 20, 8, 128)   0           re_lu_4[0][0]
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 20, 8, 128)   0           max_pooling2d_3[0][0]
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 20, 8, 256)   295168      dropout_1[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 20, 8, 256)   1024        conv2d_5[0][0]
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 20, 8, 256)   0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 10, 4, 256)   0           re_lu_5[0][0]
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 10, 4, 64)    16448       max_pooling2d_4[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 10, 4, 64)    256         conv2d_7[0][0]
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  (None, 10, 4, 64)    0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 20, 8, 64)    36928       re_lu_9[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 20, 8, 64)    256         conv2d_transpose[0][0]
__________________________________________________________________________________________________
re_lu_10 (ReLU)                 (None, 20, 8, 64)    0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 20, 8, 128)   8320        re_lu_10[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 20, 8, 128)   512         conv2d_8[0][0]
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 20, 8, 128)   0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
tf_op_layer_AddV2 (TensorFlowOp [(None, 20, 8, 128)] 0           re_lu_11[0][0]
                                                                 max_pooling2d_3[0][0]
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 20, 8, 64)    8256        tf_op_layer_AddV2[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 20, 8, 64)    256         conv2d_9[0][0]
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 20, 8, 64)    0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 40, 16, 64)   36928       re_lu_12[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 40, 16, 64)   256         conv2d_transpose_1[0][0]
__________________________________________________________________________________________________
re_lu_13 (ReLU)                 (None, 40, 16, 64)   0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 40, 16, 128)  8320        re_lu_13[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 40, 16, 128)  512         conv2d_10[0][0]
__________________________________________________________________________________________________
re_lu_14 (ReLU)                 (None, 40, 16, 128)  0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
tf_op_layer_AddV2_1 (TensorFlow [(None, 40, 16, 128) 0           re_lu_14[0][0]
                                                                 max_pooling2d_2[0][0]
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 40, 16, 32)   4128        tf_op_layer_AddV2_1[0][0]        
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 40, 16, 32)   128         conv2d_11[0][0]
__________________________________________________________________________________________________
re_lu_15 (ReLU)                 (None, 40, 16, 32)   0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 80, 32, 32)   9248        re_lu_15[0][0]
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 10, 4, 256)   590080      max_pooling2d_4[0][0]
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 80, 32, 32)   128         conv2d_transpose_2[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 10, 4, 256)   1024        conv2d_6[0][0]
__________________________________________________________________________________________________
re_lu_16 (ReLU)                 (None, 80, 32, 32)   0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 10, 4, 256)   0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 80, 32, 64)   2112        re_lu_16[0][0]
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 5, 2, 256)    0           re_lu_6[0][0]
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 80, 32, 64)   256         conv2d_12[0][0]
__________________________________________________________________________________________________
re_lu_17 (ReLU)                 (None, 80, 32, 64)   0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 5, 2, 64)     16448       max_pooling2d_5[0][0]
__________________________________________________________________________________________________
tf_op_layer_AddV2_2 (TensorFlow [(None, 80, 32, 64)] 0           re_lu_17[0][0]
                                                                 max_pooling2d_1[0][0]
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 5, 2, 64)     256         conv2d_17[0][0]
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 80, 32, 16)   1040        tf_op_layer_AddV2_2[0][0]        
__________________________________________________________________________________________________
re_lu_23 (ReLU)                 (None, 5, 2, 64)     0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 80, 32, 16)   64          conv2d_13[0][0]
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 5, 2, 64)     0           re_lu_23[0][0]
__________________________________________________________________________________________________
re_lu_18 (ReLU)                 (None, 80, 32, 16)   0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 5, 2, 64)     36928       dropout_5[0][0]
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 160, 64, 16)  2320        re_lu_18[0][0]
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 5, 2, 64)     256         conv2d_18[0][0]
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 160, 64, 16)  64          conv2d_transpose_3[0][0]
__________________________________________________________________________________________________
re_lu_24 (ReLU)                 (None, 5, 2, 64)     0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 5, 2, 256)    0           max_pooling2d_5[0][0]
__________________________________________________________________________________________________
re_lu_19 (ReLU)                 (None, 160, 64, 16)  0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 5, 2, 64)     0           re_lu_24[0][0]
__________________________________________________________________________________________________
flatten (Flatten)               (None, 2560)         0           dropout_2[0][0]
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 160, 64, 32)  544         re_lu_19[0][0]
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 5, 2, 64)     36928       dropout_6[0][0]
__________________________________________________________________________________________________
dense (Dense)                   (None, 1792)         4589312     flatten[0][0]
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 160, 64, 32)  128         conv2d_14[0][0]
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 5, 2, 64)     256         conv2d_19[0][0]
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 1792)         0           dense[0][0]
__________________________________________________________________________________________________
re_lu_20 (ReLU)                 (None, 160, 64, 32)  0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
re_lu_25 (ReLU)                 (None, 5, 2, 64)     0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 1792)         0           re_lu_7[0][0]
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 321, 129, 32) 9248        re_lu_20[0][0]
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 5, 2, 64)     0           re_lu_25[0][0]
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 896)          1606528     dropout_3[0][0]
__________________________________________________________________________________________________
re_lu_21 (ReLU)                 (None, 321, 129, 32) 0           conv2d_transpose_4[0][0]
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 640)          0           dropout_7[0][0]
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 896)          0           dense_1[0][0]
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 160, 64, 32)  9248        re_lu_21[0][0]
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 512)          328192      flatten_1[0][0]
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 896)          0           re_lu_8[0][0]
__________________________________________________________________________________________________
re_lu_22 (ReLU)                 (None, 160, 64, 32)  0           conv2d_15[0][0]
__________________________________________________________________________________________________
re_lu_26 (ReLU)                 (None, 512)          0           dense_3[0][0]
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 448)          401856      dropout_4[0][0]
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 80, 32, 3)    387         re_lu_22[0][0]
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 2)            1026        re_lu_26[0][0]
==================================================================================================
Total params: 8,363,909
Trainable params: 8,360,197
Non-trainable params: 3,712
__________________________________________________________________________________________________
